{
  "backend/main.mo": "Motoko backend defining authorization, user profiles, and product/order CRUD with admin checks and persistent maps.",
  "feature_evidence.json": "Feature evidence report listing related frontend files, components, and test IDs for admin access and login UX improvements.",
  "frontend-file-summaries.txt": "JSON-style text summarizing various frontend files, their responsibilities, and key behaviors.",
  "frontend/index.css": "Tailwind base and utility layers with light/dark OKLCH color variables and global styling.",
  "frontend/index.html": "HTML entry point that loads the React app and links the favicon.",
  "frontend/src/App.tsx": "Main React router setup defining public and protected admin routes with layout and loading handling.",
  "frontend/src/components/auth/AdminProvisioningBanner.tsx": "Disabled banner component formerly used for showing admin provisioning hints on the login page.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks definitive admin status and renders access-denied or loading states accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state, errors, and cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, main content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact info, quick links, and business details using BUSINESS_CONTACT config.",
  "frontend/src/components/layout/Header.tsx": "Displays the main header with navigation, admin links, cart button, and login button.",
  "frontend/src/components/marketing/HeroSection.tsx": "Renders a hero banner with a background image, title, and tagline for the storefront.",
  "frontend/src/config/businessContact.ts": "Defines business contact details including phone, WhatsApp, Instagram, and optional address.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, handling reinitialization on identity changes.",
  "frontend/src/hooks/useAdminProductMutations.ts": "Provides mutations to add and delete products, invalidating product queries on success.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin and tracks loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, providing identity loading, login, logout, and status handling.",
  "frontend/src/hooks/useOrders.ts": "Fetches all orders for authenticated users using the backend actor.",
  "frontend/src/hooks/usePlaceOrder.ts": "Provides a mutation to place an order by sending items and customer details to the backend.",
  "frontend/src/hooks/useProducts.ts": "Fetches products and individual product data through queries backed by the actor.",
  "frontend/src/hooks/useProvisionAdmin.ts": "Allows promoting the current user to admin and refreshes admin-related queries.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file referencing other feature-specific query hooks.",
  "frontend/src/index.css": "Tailwind base setup defining CSS variables, themes, and global styles.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Manages admin authentication using Internet Identity and admin provisioning state.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays a list of customer orders with timestamps, customer info, and item details for admin review.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin UI for listing products and adding/deleting them with validation and toast feedback.",
  "frontend/src/pages/CatalogPage.tsx": "Displays product listings with images, pricing, quantity input, and add‑to‑cart functionality.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow with cart summary, customer form validation, and order submission.",
  "frontend/src/pages/ContactUsPage.tsx": "Shows business contact options including phone, WhatsApp, Instagram, and optional address.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Shows confirmation message and order ID after a successful purchase.",
  "frontend/src/state/cartStore.ts": "Zustand store for cart items with bigint-safe persistence and basic cart operations.",
  "frontend/src/utils/images.ts": "Returns a product image URL or a placeholder if missing.",
  "frontend/src/utils/money.ts": "Formats bigint cent values into USD currency strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters via query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config extending theming, colors, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing shop features, admin auth needs, known issues, and existing feature definitions."
}